{"vector_id": 0, "pk": 1, "table": "stadiums", "text": "Stadium: Rajiv Gandhi International Stadium Pitch Report. Pitch type: Batting. Description: Rajiv Gandhi International Cricket Stadium in Hyderabad is known for its batting-friendly pitch.The surface is generally flat, providing excellent bounce and pace, which favors the batsmen, particularly in limited-overs formats like ODIs and T20s. The relatively small boundaries further contribute to high-scoring games, making it an exciting venue for batters. While bowlers may find some assistance early in the innings or under lights, the overall conditions typically tilt in favor of the batters, leading to thrilling, high-scoring encounters. Source: https://pitch-report.com/rajiv-gandhi-international-stadium-pitch-report/"}
{"vector_id": 1, "pk": 4, "table": "stadiums", "text": "Stadium: Rajiv Gandhi International Cricket Stadium Pitch Report. Pitch type: Batting. Description: Rajiv Gandhi International Stadium is a Batting Pitch.The pitch at Rajiv Gandhi International Stadium is known to be batting-friendly, offering excellent conditions for batsmen to thrive. The surface is typically flat and true, providing consistent bounce that allows the ball to come onto the bat nicely. This makes it an ideal ground for aggressive batting, where players can play their shots freely, especially in the early stages of the game. With minimal assistance for bowlers, batters often have the opportunity to score quickly, leading to high-scoring encounters. The pitch offers a great opportunity for top-order batsmen to make big contributions, and it’s not uncommon to see large totals posted here, making it a favorite for exciting, run-filled matches. Source: https://pitch-report.com/rajiv-gandhi-international-cricket-stadium-pitch-report/"}
{"vector_id": 2, "pk": 5, "table": "stadiums", "text": "Stadium: Barabati Stadium Pitch Report. Pitch type: Batting. Description: Barabati Stadium is a Batting Pitch.Barabati Stadium in Cuttack is known for its batting-friendly pitch, offering excellent conditions for scoring runs. The surface tends to favor batting, especially early on, making it ideal for setting big totals. While bowlers may find some challenge as the game progresses, chasing a score here is often more feasible due to the favorable conditions for batting throughout the match. The pitch supports high-scoring encounters, making it an exciting venue for both setting and chasing totals. Source: https://pitch-report.com/barabati-stadium-pitch-report/"}
{"vector_id": 3, "pk": 6, "table": "stadiums", "text": "Stadium: Vidarbha Cricket Association Stadium Pitch Report. Pitch type: Batting. Description: Vidarbha Cricket Association Stadium is a Batting Pitch.The pitch at Vidarbha Cricket Association Stadium is consideredbatting-friendly, offering solid bounce and pace. Batsmen are expected to dominate the conditions, with the ball coming onto the bat nicely, allowing for stroke play. The surface supports aggressive batting, particularly in the early stages, and is ideal for top-order batsmen to settle in and build partnerships. This pitch offers good scoring potential, making it favorable for high totals in the first innings. Source: https://pitch-report.com/vidarbha-cricket-association-stadium-pitch-report/"}
{"vector_id": 4, "pk": 7, "table": "stadiums", "text": "Stadium: Eden Gardens Pitch Report. Pitch type: Batting. Description: Eden Gardenis a Batting PitchEden Gardensin Kolkata is renowned as abatting-friendly pitch, especially in limited-overs cricket. The surface typically offers consistent bounce and pace, allowing batsmen to play their shots freely. In day-night matches, the pitch often favors batters in the first innings, with spinners coming into play as the game progresses. Fast outfield and shorter boundaries further enhance scoring opportunities, making it a high-scoring venue. Bowlers, particularly spinners, can find assistance in the second innings due to the pitch slowing down slightly. Overall, Eden Gardens is a paradise for batsmen and an exciting venue for fans. Source: https://pitch-report.com/eden-gardens-pitch-report/"}
{"vector_id": 5, "pk": 8, "table": "stadiums", "text": "Stadium: Melbourne Stadium Pitch Report. Pitch type: Batting. Description: MCG offers a balanced pitch with great scoring opportunities for batters.Melbourne Cricket Ground (MCG) is known for its balanced pitch, but when it comes to batting, it offers a lot to the players. The surface tends to be flat, especially in the early overs, making it ideal for stroke play. With its massive outfield, batters can take advantage of gaps and convert ones into twos. However, as the match progresses, the pitch may slow down, making shot selection crucial. A dream venue for batters who enjoy building their innings!Join Telegram Source: https://pitch-report.com/melbourne-stadium-pitch-report/"}
{"vector_id": 6, "pk": 9, "table": "stadiums", "text": "Stadium: Maharashtra Cricket Association Stadium Pitch Report. Pitch type: Batting. Description: Maharashtra Cricket Association Stadiumis known for itsbatting-friendly pitchThe pitch generally provides good conditions for batsmen, especially in the first innings, allowing them to score freely. As the game progresses, it remains relatively flat, making it easier for the batting side to post big totals. While spinners may come into play later in the match, the ground is primarily seen as a venue where high scores are achievable, making it a thrilling place for run-fests. Source: https://pitch-report.com/maharashtra-cricket-association-stadium-pitch-report/"}
{"vector_id": 7, "pk": 10, "table": "stadiums", "text": "Stadium: Old Trafford Pitch Report. Pitch type: Batting. Description: Old Trafford Cricket Ground Is a batting Pitch.Old Trafford Cricket Ground is generally considered abatting-friendly pitch. The surface typically offers good bounce and pace, making it conducive to high scoring. Batsmen can play their shots with confidence, especially during the first innings. While bowlers might find some assistance in the early overs, the pitch usually becomes more favorable for batting as the game progresses, allowing for big totals. Teams winning the toss often choose to bat first, taking advantage of the favorable batting conditions early in the match. Source: https://pitch-report.com/old-trafford-pitch-report/"}
{"vector_id": 8, "pk": 11, "table": "stadiums", "text": "Stadium: Simonds Stadium Pitch Report. Pitch type: Batting. Description: Simonds Stadium is batting pitch.Simonds Stadium (GMHBA Stadium) in Geelong is generally known to favorbatting. The pitch offers good bounce and pace, which benefits the batters, especially early in the innings. However, as the game progresses,bowlers—particularly spinners—can get more assistance from the slowing conditions, making it more challenging for the batting side in the later stages. Overall, the pitch tends to be morebatting-friendly. Source: https://pitch-report.com/simonds-stadium-pitch-report/"}
{"vector_id": 9, "pk": 12, "table": "stadiums", "text": "Stadium: Eden Park Auckland Pitch Report. Pitch type: Bowling. Description: Eden park cricket stadium is a bowling pitch.Eden Park is known for itsbowling-friendly pitch, where the conditions early in the match offer significant assistance to bowlers, especially pacers. The pitch can be challenging for batsmen, particularly in the second innings, as it tends to become more difficult to score. Teams bowling first can capitalize on these conditions to restrict the opposition to a low total. In contrast, the batting side may struggle to chase down the target in the second innings due to the harsh pitch conditions. Source: https://pitch-report.com/eden-park-auckland-pitch-report/"}
{"vector_id": 10, "pk": 67, "table": "stadiums", "text": "Stadium: Zahur Ahmed Chowdhury Stadium Pitch Report. Pitch type: Batting. Description: Zahur Ahmed Chowdhury Cricket Ground is a Batting pitch.Zahur Ahmed Chowdhury Cricket Ground is a batting-friendly venue, offering a flat and hard pitch ideal for high-scoring matches. Batsmen enjoy consistent bounce and favorable conditions, making it perfect for aggressive stroke play.Join Telegram Source: https://pitch-report.com/zahur-ahmed-chowdhury-stadium-pitch-report/"}
{"vector_id": 11, "pk": 13, "table": "stadiums", "text": "Stadium: Himachal Pradesh Cricket Association Stadium Pitch Report. Pitch type: Batting. Description: The Himachal Pradesh Cricket Association Stadium is Batting Pitch.The Himachal Pradesh Cricket Association (HPCA) Stadium pitch tends to favor batting, especially in the first innings. With an average score of 184 for the team batting first, the pitch provides good conditions for batsmen to score runs freely, especially during the early part of the game. However, the pitch can provide some assistance to bowlers as the match progresses, particularly to spinners. In general, it is considered a batting-friendly pitch with some help for bowlers later on. Source: https://pitch-report.com/himachal-pradesh-cricket-association-stadium-pitch-report/"}
{"vector_id": 12, "pk": 14, "table": "stadiums", "text": "Stadium: Dubai International Cricket Stadium Pitch Report. Pitch type: Batting. Description: Dubai International Stadium is batting freindly pitch.The Dubai International Stadium is known for being a batting-friendly pitch, offering consistent bounce and good carry, making it ideal for stroke-making. Teams batting first often post competitive totals, as the surface allows batters to play their shots freely. While spinners may find some assistance in the middle overs, the pitch largely supports high-scoring games, making it a paradise for batters. Winning the toss and opting to bat first is often the preferred strategy at this venue.Join Telegram Source: https://pitch-report.com/dubai-international-cricket-stadium-pitch-report/"}
{"vector_id": 13, "pk": 15, "table": "stadiums", "text": "Stadium: Trent Bridge Pitch Report. Pitch type: Batting. Description: Trent Bridge Stadium Is a Batting Pitch.Trent Bridge Stadium is generally considered abatting-friendly pitch. The surface offers good bounce and pace, which allows batsmen to play their shots confidently. While it does provide some assistance to the bowlers, especially early on, the conditions tend to favor the batters, making it an ideal venue for high-scoring matches. The boundary sizes and flat nature of the pitch further enhance the prospects for big totals. Source: https://pitch-report.com/trent-bridge-pitch-report/"}
{"vector_id": 14, "pk": 16, "table": "stadiums", "text": "Stadium: Shaheed Veer Narayan Singh International Stadium Pitch Report. Pitch type: Batting. Description: The Shaheed Veer Narayan Singh International Stadium is a batting-friendly pitch.The Shaheed Veer Narayan Singh International Stadium in Raipur can occasionally offer assistance to bowlers, particularly in the early stages of the game. The pitch tends to provide good bounce and movement, making it challenging for batsmen, especially during the initial overs. Fast bowlers may find some swing and pace, while spinners can exploit any rough patches that develop as the game progresses. Though not predominantly a bowler’s pitch, it does offer a balanced contest, allowing bowlers to capitalize on favorable conditions when they arise. Source: https://pitch-report.com/shaheed-veer-narayan-singh-international-stadium-pitch-report/"}
{"vector_id": 15, "pk": 17, "table": "stadiums", "text": "Stadium: Maharaja Yadavindra Singh International Cricket Stadium Pitch Report. Pitch type: Batting. Description: Maharaja Yadavindra Singh International Cricket Stadiumis batting-friendly pitch.The surface provides good pace and bounce, allowing batsmen to play aggressive shots and score quickly. The boundaries are relatively short, which further enhances the potential for high-scoring matches. While pacers can extract some movement early on, the pitch generally favors batsmen, especially when the ball gets older, offering easy runs. Overall, it’s a pitch that promotes attacking cricket and results in high-scoring games. Source: http://pitch-report.com/maharaja-yadavindra-singh-international-cricket-stadium-pitch-report/"}
{"vector_id": 16, "pk": 18, "table": "stadiums", "text": "Stadium: Narendra Modi Stadium Pitch Report. Pitch type: Batting. Description: The Narendra Modi Stadium is renowned for its batting-friendly conditions, making it a paradise for batsmen.The pitch offers a true and consistent bounce, allowing players to execute their strokes freely. Fast outfields further enhance scoring opportunities, rewarding well-timed shots. While pacers may find some movement early on, the pitch generally settles into a batter’s haven as the game progresses. Spinners can come into play during the latter stages, adding an element of strategy to the game. High-scoring encounters are a hallmark of this venue, with batsmen often dominating proceedings, making it an exciting ground for cricket enthusiasts.Join Telegram Source: https://pitch-report.com/narendra-modi-stadium-pitch-report/"}
{"vector_id": 17, "pk": 19, "table": "stadiums", "text": "Stadium: Nassau County International Cricket Stadium Pitch Report. Pitch type: Bowling. Description: Nassau County International Stadium is a Bowling Pitch.TheNassau County International Stadiumis generally known to be abowling-friendly pitch. It provides significant assistance to bowlers, particularly in the early stages of the game. Fast bowlers can exploit the early swing, and spinners might find the surface offering some turn as the game progresses. The pitch typically leads to low-scoring encounters, as the bowlers are able to maintain control and dominate the batsmen. The challenging nature of the wicket often results in tight, low-scoring contests, with teams needing to be cautious in their batting approach. Source: https://pitch-report.com/nassau-county-international-cricket-stadium-pitch-report/"}
{"vector_id": 18, "pk": 20, "table": "stadiums", "text": "Stadium: Basin Reserve Wellington Pitch Report. Pitch type: Batting. Description: Basin Reserve is a Batting pitch.In this ground it is generally consider a batting pitch, but it tends to favor the batters, especially in limited-overs formats. The pitch provides good bounce and pace, which helps the batsmen play aggressive shots. However, it can also offer some assistance to bowlers, particularly pacers, early in the innings or under overcast conditions. Overall, while both batters and bowlers can find some advantage, Basin Reserve is known to offer favorable conditions for batting, making for high-scoring matches in limited-overs cricket. Source: https://pitch-report.com/basin-reserve-wellington-pitch-report/"}
{"vector_id": 19, "pk": 21, "table": "stadiums", "text": "Stadium: Sheikh Zayed Stadium Pitch Report. Pitch type: Batting. Description: The Sheikh Zayed Stadium is batting pitch.The Sheikh Zayed Stadium is a batting-friendly pitch. It offers good bounce and carry, allowing batters to play their shots freely, especially in the early overs. However, spinners may find some assistance as the match progresses, keeping the contest balanced.Join Telegram Source: https://pitch-report.com/sheikh-zayed-stadium-pitch-report/"}
{"vector_id": 20, "pk": 22, "table": "stadiums", "text": "Stadium: Greenfield International Stadium Report. Pitch type: Bowling. Description: The Greenfield International Stadium is  bowling-friendly pitch.Greenfield International Stadium is known for its bowling-friendly pitch, where bowlers typically find more assistance than batsmen. Fast bowlers can extract movement early in the game, especially with overcast conditions, while spinners come into play as the match progresses, benefiting from the pitch’s grip and turn. The surface tends to offer consistent bounce, which challenges the batsmen to play with caution. Due to these conditions, matches often see low to moderate scores, and bowling units tend to dominate, making it a challenging venue for aggressive batting. Source: https://pitch-report.com/greenfield-international-stadium-report/"}
{"vector_id": 21, "pk": 23, "table": "stadiums", "text": "Stadium: Multan Cricket Stadium Pitch Report. Pitch type: Batting. Description: Multan Stadium is a batting pitch.Multan Cricket Stadiumis renowned for itsbatting-friendly conditions, offering a great surface for batsmen to score freely. The pitch provides solid support for aggressive batting early on, making it ideal for setting big totals. Although the conditions may become more challenging as the game progresses, the early stages remain favorable for batsmen. Teams winning the toss would likely choose tobat first, aiming to capitalize on the favorable conditions and put up a strong total. Source: https://pitch-report.com/multan-cricket-stadium-pitch-report/"}
{"vector_id": 22, "pk": 24, "table": "stadiums", "text": "Stadium: Jsca International Stadium Complex Pitch Report. Pitch type: Bowling. Description: The JSCA International Stadium isbowling pitch.The JSCA International Stadium is generally considered abowling pitch. The conditions tend to favor bowlers, especially in the second innings, with the pitch offering some assistance in terms of bounce and movement. While batsmen may find some opportunities early on, the surface can become tougher to bat on as the game progresses, making it more favorable for the bowlers. Source: http://pitch-report.com/jsca-international-stadium-complex-pitch-report/"}
{"vector_id": 23, "pk": 25, "table": "stadiums", "text": "Stadium: Rawalpindi Cricket Stadium Pitch Report. Pitch type: Batting. Description: Rawal Pindi Ground is a Batting Behaviour Pitch.The Rawalpindi Ground is known for itsbatting-friendly pitch, offering excellent conditions for batsmen. The surface provides good pace and bounce, making it easier for batsmen to score freely and play aggressive shots. As a result, high-scoring matches are common here, with batsmen benefiting from the favorable pitch conditions. The pitch generally favors attacking play and allows for big totals to be set. Source: https://pitch-report.com/rawalpindi-cricket-stadium-pitch-report/"}
{"vector_id": 24, "pk": 26, "table": "stadiums", "text": "Stadium: Rajiv Gandhi International Stadium Pitch Report. Pitch type: Batting. Description: Rajiv Gandhi International Cricket Stadium in Hyderabad is known for its batting-friendly pitch.The surface is generally flat, providing excellent bounce and pace, which favors the batsmen, particularly in limited-overs formats like ODIs and T20s. The relatively small boundaries further contribute to high-scoring games, making it an exciting venue for batters. While bowlers may find some assistance early in the innings or under lights, the overall conditions typically tilt in favor of the batters, leading to thrilling, high-scoring encounters. Source: https://pitch-report.com/rajiv-gandhi-international-stadium-pitch-report/"}
{"vector_id": 25, "pk": 27, "table": "stadiums", "text": "Stadium: Wpl Today Match Pitch Report. Source: https://pitch-report.com/wpl-today-match-pitch-report/"}
{"vector_id": 26, "pk": 28, "table": "stadiums", "text": "Stadium: Saxton Oval Nelson Pitch Report. Pitch type: Batting. Description: Saxton Oval Stadium is a Batting Pitch.A batting-friendly pitchprovides excellent conditions for batsmen, offering good bounce and carry throughout the match. The pitch tends to favor aggressive stroke play, allowing batters to score freely, especially in the middle and later overs. While pacers may get some early movement, the true nature of the surface generally supports batting, making it ideal for high-scoring games. Spinners may find some turn as the match progresses, but overall, a batting-friendly pitch offers the best chances for big scores. Source: https://pitch-report.com/saxton-oval-nelson-pitch-report/"}
{"vector_id": 27, "pk": 29, "table": "stadiums", "text": "Stadium: Queens Park Oval Pitch Report. Pitch type: Bowling. Description: Batting or Bowling Pitch Source: https://pitch-report.com/queens-park-oval-pitch-report/"}
{"vector_id": 28, "pk": 30, "table": "stadiums", "text": "Stadium: Dr Dy Patil Sports Academy Pitch Report. Pitch type: Batting. Description: The pitch at Dr. D.Y Patil Sports Academy is Batting  Pitch.This Stadium typically offers good bounce and consistent pace, allowing batsmen to play their shots comfortably. The surface is usually flat, creating ideal conditions for high scores, especially in limited-overs formats where aggressive batting takes center stage. Fast bowlers can find some movement early in the game, particularly under favorable weather conditions, but as the match progresses, it becomes easier for batsmen to settle in and build big partnerships. Spinners also come into play in the middle and later stages of the game, as the pitch tends to dry out slightly, offering some grip and turn. The high-altitude location can sometimes aid bowlers with extra carry, but overall, it remains a batsman-friendly venue. surface tends to be flat, providing ideal conditions for high scores, especially in limited-overs formats. Source: https://pitch-report.com/dr-dy-patil-sports-academy-pitch-report/"}
{"vector_id": 29, "pk": 31, "table": "stadiums", "text": "Stadium: Gwalior International Cricket Stadium Pitch Report. Pitch type: Batting. Description: Gwalior International Stadium is considered a batting pitch.The surface provides a solid foundation for batters, allowing them to play aggressive shots once they get set. The pitch generally offers good bounce and a consistent pace, making it easier for batsmen to time the ball well. While there may be some assistance for bowlers early on, especially in the first few overs, the conditions generally favor high scores and a free-flowing contest between bat and ball. Source: https://pitch-report.com/gwalior-international-cricket-stadium-pitch-report/"}
{"vector_id": 30, "pk": 32, "table": "stadiums", "text": "Stadium: Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium Pitch Report. Pitch type: Batting. Description: Balanced with a slight edge for batting.Ekana Cricket Stadium in Cuttack generally favors the batsmen, with a good balance between bat and ball. The pitch tends to provide a decent amount of bounce and carry, helping the batsmen to score runs, especially in the initial overs. However, the spinners can also come into play later in the game, making it a mixed surface. Source: https://pitch-report.com/bharat-ratna-shri-atal-bihari-vajpayee-ekana-cricket-stadium-pitch-report/"}
{"vector_id": 31, "pk": 33, "table": "stadiums", "text": "Stadium: Headingley Cricket Ground Pitch Report. Pitch type: Bowling. Description: Headingley Cricket Ground is a Batting pitch.Headingley Cricket Ground is generally considered abowling-friendly pitch. Fast bowlers can extract early movement, especially if the conditions are overcast. The pitch can offer bounce and help seamers early on, while spinners may get assistance as the game progresses. So, if you’re predicting for the toss, the team winning it would likely prefer tobowlfirst. Source: https://pitch-report.com/headingley-cricket-ground-pitch-report/"}
{"vector_id": 32, "pk": 34, "table": "stadiums", "text": "Stadium: Manuka Oval Pitch Report. Pitch type: Batting. Description: Manuka Oval is a batting-friendly pitch.Manuka Oval in Canberra features a batting-friendly pitch with true bounce, ideal for aggressive strokemakers. While pacers may get some early movement, the pitch generally favors batsmen as the game progresses, making it conducive to high scores and attacking cricket. Source: https://pitch-report.com/manuka-oval-pitch-report/"}
{"vector_id": 33, "pk": 35, "table": "stadiums", "text": "Stadium: The Rose Bowl Pitch Report. Pitch type: Batting. Description: The Rose Bowl Cricket Ground Is a Batting Pitch.The Rose Bowl Cricket Ground is known for its batting-friendly pitch, which tends to favor batsmen with consistent bounce and good carry. This surface often leads to high-scoring games, allowing batters to play aggressive shots throughout the innings. While bowlers can still make an impact, the pitch generally offers more rewards to those who are patient and able to build partnerships. The conditions at this venue create an exciting atmosphere, with big totals and thrilling run chases being a common feature. Source: https://pitch-report.com/the-rose-bowl-pitch-report/"}
{"vector_id": 34, "pk": 36, "table": "stadiums", "text": "Stadium: Galle International Stadium Pitch Report. Pitch type: Batting. Description: Galle International Stadium is batting pitch.Galle International Stadium is known for its spin-friendly surface, making it a haven for batters who can handle turn and bounce. While the pitch offers assistance to spinners from Day 3 onward, batters often enjoy scoring runs in the early stages of the game, especially against the new ball. Patience and skill are key to building a big total here!Join Telegram Source: https://pitch-report.com/galle-international-stadium-pitch-report/"}
{"vector_id": 35, "pk": 37, "table": "stadiums", "text": "Stadium: Today Ipl Match Pitch Report. Source: https://pitch-report.com/today-ipl-match-pitch-report/"}
{"vector_id": 36, "pk": 93, "table": "stadiums", "text": "Stadium: Manuka Oval Pitch Report. Pitch type: Batting. Description: Manuka Oval is a batting-friendly pitch.Manuka Oval in Canberra features a batting-friendly pitch with true bounce, ideal for aggressive strokemakers. While pacers may get some early movement, the pitch generally favors batsmen as the game progresses, making it conducive to high scores and attacking cricket. Source: https://pitch-report.com/manuka-oval-pitch-report/"}
{"vector_id": 37, "pk": 38, "table": "stadiums", "text": "Stadium: Newlands Pitch Report. Pitch type: Batting. Description: Newlands Cricket Stadium is a Batting Pitch.Newlands Cricket Stadium is known for providing a balanced pitch that starts off challenging for batsmen but gradually becomes more favorable as the match progresses. Initially, fast bowlers can extract movement, making it tough for the batsmen. However, after the first few overs, the pitch settles, offering consistent bounce and allowing the batters to dominate the game. Overall, it’s a pitch that strengthens batting in the later stages. Source: https://pitch-report.com/newlands-pitch-report/"}
{"vector_id": 38, "pk": 39, "table": "stadiums", "text": "Stadium: M Chinnaswamy Stadium Pitch Report. Pitch type: Batting. Description: M.Chinnaswamy Stadium is a batting friendly pitch.M. Chinnaswamy Stadium is known for being abatting-friendly pitch, offering good bounce and pace that favors the batsmen. The pitch tends to flatten out as the match progresses, allowing the batters to score freely, especially in the second innings. Although pacers can get some initial movement, the conditions generally favor high-scoring games. Teams chasing big totals here have a good chance of success if they can handle the pressure and pace of the initial overs. Source: https://pitch-report.com/m-chinnaswamy-stadium-pitch-report/"}
{"vector_id": 39, "pk": 40, "table": "stadiums", "text": "Stadium: Gaddafi Stadium Pitch Report. Pitch type: Batting. Description: Gaddafi Stadium is Batting friendly pitch.Gaddafi Stadium is widely regarded as a paradise for batsmen, thanks to its batting-friendly pitch. The surface offers consistent bounce and pace, allowing players to execute their shots with ease and confidence. Coupled with a fast outfield, even well-timed shots race to the boundary, making it a high-scoring venue. While spinners might get some grip as the match progresses, the pitch remains a haven for stroke-makers throughout most of the game. Source: https://pitch-report.com/gaddafi-stadium-pitch-report/"}
{"vector_id": 40, "pk": 41, "table": "stadiums", "text": "Stadium: Ma Chidambaram Stadium Pitch Report. Pitch type: Batting. Description: MA Chidambaram Stadium is a Batting Pitch.The pitch is known for its strong support for batsmen, especially early in the game, allowing them to score freely with good pace and bounce. While the surface may slow down as the match progresses, batters who can adapt to changing conditions often dominate. Spinners come into play later, but the initial stages provide an excellent opportunity for batsmen to capitalize. A team with powerful top-order batters who can exploit the favorable conditions early tends to thrive at this venue. Source: https://pitch-report.com/ma-chidambaram-stadium-pitch-report/"}
{"vector_id": 41, "pk": 42, "table": "stadiums", "text": "Stadium: Docklands Stadium Pitch Report. Pitch type: Bowling. Description: Docklands Stadium is a bowling-friendly pitch, favoring pacersDocklands Stadium, also known as Marvel Stadium, is generally considered a bowling-friendly pitch, especially for pacers. The surface often offers good bounce and carry, making it ideal for seam and swing bowlers. Spinners may find it challenging, but disciplined bowling can create opportunities. Scores here are usually moderate, making it a competitive venue Source: https://pitch-report.com/docklands-stadium-pitch-report/"}
{"vector_id": 42, "pk": 43, "table": "stadiums", "text": "Stadium: National Stadium Karachi Pitch Report. Pitch type: Batting. Description: National Cricket Stadium Is a Batting Pitch.National Cricket Stadium is a batting-friendly pitch that tends to favor the batsmen. The surface generally offers good bounce and pace, allowing the batters to play their shots with confidence. Expect higher scores and quick run rates, especially in the first innings. The bowlers will need to be accurate and strategic to make an impact on this pitch. Source: https://pitch-report.com/national-stadium-karachi-pitch-report/"}
{"vector_id": 43, "pk": 44, "table": "stadiums", "text": "Stadium: Pallekele International Cricket Stadium Pitch Report. Pitch type: Bowling. Description: Batting or Bowling PitchJoin Telegram Source: https://pitch-report.com/pallekele-international-cricket-stadium-pitch-report/"}
{"vector_id": 44, "pk": 45, "table": "stadiums", "text": "Stadium: Holkar Cricket Stadium Pitch Report. Pitch type: Batting. Description: Holkar Stadium is  batting pitch.. The surface tends to favor batsmen, providing good bounce and pace, making it ideal for stroke play. While fast bowlers may find some assistance with the new ball, the pitch typically becomes more favorable for batsmen as the game progresses. Spinners can also come into play during the middle overs, but overall, it is a high-scoring ground, with batters having the advantage. Source: https://pitch-report.com/holkar-cricket-stadium-pitch-report/"}
{"vector_id": 45, "pk": 46, "table": "stadiums", "text": "Stadium: Brabourne Stadium Pitch Report. Pitch type: Batting. Description: Brabourne Stadium is batting-friendly with occasional slow turn for spinners.Brabourne Stadium offers consistent bounce and a good pace that favors stroke play, making it an ideal ground for high-scoring matches. While the surface predominantly supports batting, spinners can find some slow turn as the game progresses, especially in the latter stages. This mix of conditions makes Brabourne Stadium an exciting venue for both aggressive batting and strategic bowling. Source: https://pitch-report.com/brabourne-stadium-pitch-report/"}
{"vector_id": 46, "pk": 47, "table": "stadiums", "text": "Stadium: The Wanderers Stadium Pitch Report. Pitch type: Batting. Description: The Wanderers is known for its batting-friendly pitch.Where batters enjoy good support throughout the game. The pitch offers consistent bounce and pace, making it easier to score runs, particularly for the top order. However, chasing big totals can still be challenging, and teams winning the toss often prefer to set a strong total by batting first. Source: https://pitch-report.com/the-wanderers-stadium-pitch-report/"}
{"vector_id": 47, "pk": 48, "table": "stadiums", "text": "Stadium: R Premadasa Stadium Khettarama Pitch Report. Pitch type: Mixed. Description: R.Premadasa Stadium is a bowlling pitchR.Premadasa Stadium is known for being a bowler-friendly pitch where pacers can exploit early movement, and spinners often play a key role as the game progresses. The surface tends to provide assistance to bowlers, especially in the first innings, making it challenging for batsmen to settle. Teams winning the toss may prefer to bowl first, taking advantage of the conditions that favor bowlers early on.Join Telegram Source: https://pitch-report.com/r-premadasa-stadium-khettarama-pitch-report/"}
{"vector_id": 48, "pk": 49, "table": "stadiums", "text": "Stadium: Arun Jaitley Stadium Pitch Report. Pitch type: Batting. Description: Arun Jaitley Stadium favors batsmen with good bounce and short boundaries.Arun Jaitley Stadium is known for being a batting-friendly pitch. The surface offers good bounce and a solid foundation, which allows batsmen to play their shots with confidence. With shorter boundaries, it provides ample opportunities for quick runs. While pacers might find some assistance early on, the pitch generally favors the batsmen, especially in the first innings. This makes it a great venue for high-scoring matches, with the potential for big totals. However, as the game progresses, spinners may also find some grip in the later overs. Source: https://pitch-report.com/arun-jaitley-stadium-pitch-report/"}
{"vector_id": 49, "pk": 50, "table": "stadiums", "text": "Stadium: Supersport Park Pitch Report. Pitch type: Batting. Description: SuperSport Park Stadium is a batting freindly pitchThe surface at SuperSport Park in Centurion is known for its flat,batting-friendly conditions, offering little assistance to bowlers. While batters can accumulate runs quickly, captains winning the toss may prefer tobowl first, aiming to exploit any early movement or potential moisture in the pitch before it becomes easier to bat in the second innings. This strategy provides a chance tochase downa target later on a more predictable surface. Source: https://pitch-report.com/supersport-park-pitch-report/"}
{"vector_id": 50, "pk": 51, "table": "stadiums", "text": "Stadium: Zahur Ahmed Chowdhury Stadium Pitch Report. Pitch type: Batting. Description: Zahur Ahmed Chowdhury Cricket Ground is a Batting pitch.Zahur Ahmed Chowdhury Cricket Ground is a batting-friendly venue, offering a flat and hard pitch ideal for high-scoring matches. Batsmen enjoy consistent bounce and favorable conditions, making it perfect for aggressive stroke play.Join Telegram Source: https://pitch-report.com/zahur-ahmed-chowdhury-stadium-pitch-report/"}
{"vector_id": 51, "pk": 52, "table": "stadiums", "text": "Stadium: Sydney Cricket Ground Pitch Report. Pitch type: Batting. Description: TheSydney Cricket Groundis a Batting pitchAt Sydney Cricket Ground, the toss plays a crucial role, with teams batting first having a slight advantage, winning 52% of the time. The pitch tends to slow down in the second innings, making it harder to chase down big totals. Therefore, the team winning the toss is likely to opt for batting first to capitalize on the good conditions early on. This gives them a better chance of setting a challenging total and putting pressure on the chasing side. Source: https://pitch-report.com/sydney-cricket-ground-pitch-report/"}
{"vector_id": 52, "pk": 53, "table": "stadiums", "text": "Stadium: Green Park Stadium Pitch Report. Pitch type: Bowling. Description: Bowling Freindly PitchGreen Park Stadium generally tends to favor bowlers, especially in the T20 format. With a dry and slightly slower surface, bowlers get good assistance, particularly spinners. However, during the latter stages of the match, the pitch becomes more favorable to the batting side, allowing for higher scores. Source: https://pitch-report.com/green-park-stadium-pitch-report/"}
{"vector_id": 53, "pk": 54, "table": "stadiums", "text": "Stadium: University Of Texas Dallas Pitch Report. Pitch type: Bowling. Description: Batting or Bowling Pitch Source: https://pitch-report.com/university-of-texas-dallas-pitch-report/"}
{"vector_id": 54, "pk": 55, "table": "stadiums", "text": "Stadium: Perth Stadium Pitch Report. Pitch type: Bowling. Description: Perth Stadium is a bowling pitch that supports pacers.Perth Stadium is renowned for its pace and bounce, creating the perfect conditions for fast bowlers. With such a dynamic surface, this match is set to deliver an exciting start to the series. So its clearly visible that Perth Stadium is a bowling pitch. Source: https://pitch-report.com/perth-stadium-pitch-report/"}
{"vector_id": 55, "pk": 56, "table": "stadiums", "text": "Stadium: Barsapara Cricket Stadium Pitch Report. Pitch type: Batting. Description: Barsapara Cricket Stadium is a Batting Pitch.Barsapara Cricket Stadium is known for being abatting-friendly pitch. The surface typically offers good bounce and pace, which allows batsmen to play their shots freely, especially in the early stages of the innings. However, as the game progresses, the pitch may slow down slightly, but it still remains favorable for batting, making it ideal for high-scoring matches. Bowlers will need to be strategic to pick wickets, especially in the later stages of the game. Source: https://pitch-report.com/barsapara-cricket-stadium-pitch-report/"}
{"vector_id": 56, "pk": 57, "table": "stadiums", "text": "Stadium: Sulaibiya Cricket Ground Pitch Report. Pitch type: Bowling. Description: Batting or Bowling Pitch Source: https://pitch-report.com/sulaibiya-cricket-ground-pitch-report/"}
{"vector_id": 57, "pk": 58, "table": "stadiums", "text": "Stadium: Bay Oval Mount Maunganui Pitch Report. Pitch type: Bowling. Description: Bay Oval Cricket Ground is Bowling Pitch.Bay Oval’s bowling pitch is a dynamic challenge for bowlers, with its fresh grass providing ideal conditions for pace and bounce. Fast bowlers can capitalize on the early moisture for swing, while seamers can find movement off the pitch. The conditions remain favorable for bowlers throughout, offering a perfect balance of speed and swing, ensuring an exciting battle between bat and ball. Source: https://pitch-report.com/bay-oval-mount-maunganui-pitch-report/"}
{"vector_id": 58, "pk": 59, "table": "stadiums", "text": "Stadium: Mahinda Rajapaksa International Cricket Stadium Pitch Report. Pitch type: Bowling. Description: Batting or Bowling PitchJoin Telegram Source: https://pitch-report.com/mahinda-rajapaksa-international-cricket-stadium-pitch-report/"}
{"vector_id": 59, "pk": 60, "table": "stadiums", "text": "Stadium: Hagley Oval Christ Church Pitch Report. Pitch type: Batting. Description: Hagley Oval Ground is a batting Pitch.The pitch offers good bounce and pace, making it favorable for batsmen, especially during the early stages of the match. It allows players to build solid innings, and the outfield is typically quick, which encourages boundary-hitting. While the bowlers do get some assistance early on, the surface tends to flatten out as the game progresses, offering ideal conditions for the batting side to dominate. This combination of factors makes it a great venue for high-scoring encounters. Source: https://pitch-report.com/hagley-oval-christ-church-pitch-report/"}
{"vector_id": 60, "pk": 61, "table": "stadiums", "text": "Stadium: Wankhede Stadium Pitch Report. Pitch type: Batting. Description: Wankhede Stadium is Batting Pitch.Wankhede Stadium in Mumbai is known for its batting-friendly pitch, offering a true bounce and fast outfield. The conditions favor stroke play, providing ample opportunity for the batsmen to score quickly. With its flat surface and shorter boundaries, it’s a high-scoring venue where big totals are often chased down with ease. Expect explosive batting performances under the bright lights of this iconic ground! Source: https://pitch-report.com/wankhede-stadium-pitch-report/"}
{"vector_id": 61, "pk": 62, "table": "stadiums", "text": "Stadium: Dr Ys Rajasekhara Reddy Aca Vdca Cricket Stadium Pitch Report. Pitch type: Batting. Description: Dr. YS Rajasekhara Reddy ACA VDCA Stadium is known for its batting pitch.Dr. YS Rajasekhara Reddy ACA VDCA Stadium is known for its batting-friendly pitch, offering a smooth surface that allows batsmen to play their shots freely. The pitch provides consistent bounce and pace, making it a paradise for stroke-makers. Batters can build long innings here, especially as the game progresses and the pitch becomes even more predictable. Source: https://pitch-report.com/dr-ys-rajasekhara-reddy-aca-vdca-cricket-stadium-pitch-report/"}
{"vector_id": 62, "pk": 63, "table": "stadiums", "text": "Stadium: Sawai Mansingh Stadium Pitch Report. Pitch type: Batting. Description: Sawai Mansingh Stadium is a batting-friendly pitch.The flat surface and relatively small boundaries make it conducive to high-scoring matches, especially in limited-overs formats like ODIs and T20s. Batsmen often enjoy favorable conditions here, with good bounce and pace. While bowlers can still find some assistance, especially in the initial overs or under lights, the pitch overall tends to favor the batters, making for exciting, high-scoring games. Source: https://pitch-report.com/sawai-mansingh-stadium-pitch-report/"}
{"vector_id": 63, "pk": 64, "table": "stadiums", "text": "Stadium: Lords Cricket Ground Pitch Report. Pitch type: Bowling. Description: Lords  Cricket Ground Is a Bowling Pitch.Lord’s Cricket Ground is considered abowling-friendly pitch. The pitch typically offers assistance to both fast bowlers and spinners, particularly early in the game. Fast bowlers can extract movement, while spinners may find grip and turn as the match progresses. The conditions, especially with overcast weather, can make it challenging for batters in the initial overs. Teams winning the toss often choose to bowl first to take advantage of these favorable bowling conditions. As the game continues, the pitch may settle a bit, but bowling remains an advantage overall. Source: https://pitch-report.com/lords-cricket-ground-pitch-report/"}
{"vector_id": 64, "pk": 65, "table": "stadiums", "text": "Stadium: The Wanderers Stadium Pitch Report. Pitch type: Batting. Description: The Wanderers is known for its batting-friendly pitch.Where batters enjoy good support throughout the game. The pitch offers consistent bounce and pace, making it easier to score runs, particularly for the top order. However, chasing big totals can still be challenging, and teams winning the toss often prefer to set a strong total by batting first. Source: https://pitch-report.com/the-wanderers-stadium-pitch-report/"}
{"vector_id": 65, "pk": 66, "table": "stadiums", "text": "Stadium: Saxton Oval Nelson Pitch Report. Pitch type: Batting. Description: Saxton Oval Stadium is a Batting Pitch.A batting-friendly pitchprovides excellent conditions for batsmen, offering good bounce and carry throughout the match. The pitch tends to favor aggressive stroke play, allowing batters to score freely, especially in the middle and later overs. While pacers may get some early movement, the true nature of the surface generally supports batting, making it ideal for high-scoring games. Spinners may find some turn as the match progresses, but overall, a batting-friendly pitch offers the best chances for big scores. Source: https://pitch-report.com/saxton-oval-nelson-pitch-report/"}
{"vector_id": 66, "pk": 94, "table": "stadiums", "text": "Stadium: Pallekele International Cricket Stadium Pitch Report. Pitch type: Bowling. Description: Batting or Bowling PitchJoin Telegram Source: https://pitch-report.com/pallekele-international-cricket-stadium-pitch-report/"}
{"vector_id": 67, "pk": 68, "table": "stadiums", "text": "Stadium: Dubai International Cricket Stadium Pitch Report. Pitch type: Batting. Description: Dubai International Stadium is batting freindly pitch.The Dubai International Stadium is known for being a batting-friendly pitch, offering consistent bounce and good carry, making it ideal for stroke-making. Teams batting first often post competitive totals, as the surface allows batters to play their shots freely. While spinners may find some assistance in the middle overs, the pitch largely supports high-scoring games, making it a paradise for batters. Winning the toss and opting to bat first is often the preferred strategy at this venue.Join Telegram Source: https://pitch-report.com/dubai-international-cricket-stadium-pitch-report/"}
{"vector_id": 68, "pk": 69, "table": "stadiums", "text": "Stadium: Brabourne Stadium Pitch Report. Pitch type: Batting. Description: Brabourne Stadium is batting-friendly with occasional slow turn for spinners.Brabourne Stadium offers consistent bounce and a good pace that favors stroke play, making it an ideal ground for high-scoring matches. While the surface predominantly supports batting, spinners can find some slow turn as the game progresses, especially in the latter stages. This mix of conditions makes Brabourne Stadium an exciting venue for both aggressive batting and strategic bowling. Source: https://pitch-report.com/brabourne-stadium-pitch-report/"}
{"vector_id": 69, "pk": 70, "table": "stadiums", "text": "Stadium: Sawai Mansingh Stadium Pitch Report. Pitch type: Batting. Description: Sawai Mansingh Stadium is a batting-friendly pitch.The flat surface and relatively small boundaries make it conducive to high-scoring matches, especially in limited-overs formats like ODIs and T20s. Batsmen often enjoy favorable conditions here, with good bounce and pace. While bowlers can still find some assistance, especially in the initial overs or under lights, the pitch overall tends to favor the batters, making for exciting, high-scoring games. Source: https://pitch-report.com/sawai-mansingh-stadium-pitch-report/"}
{"vector_id": 70, "pk": 71, "table": "stadiums", "text": "Stadium: Galle International Stadium Pitch Report. Pitch type: Batting. Description: Galle International Stadium is batting pitch.Galle International Stadium is known for its spin-friendly surface, making it a haven for batters who can handle turn and bounce. While the pitch offers assistance to spinners from Day 3 onward, batters often enjoy scoring runs in the early stages of the game, especially against the new ball. Patience and skill are key to building a big total here!Join Telegram Source: https://pitch-report.com/galle-international-stadium-pitch-report/"}
{"vector_id": 71, "pk": 72, "table": "stadiums", "text": "Stadium: Wpl Today Match Pitch Report. Source: https://pitch-report.com/wpl-today-match-pitch-report/"}
{"vector_id": 72, "pk": 73, "table": "stadiums", "text": "Stadium: Sydney Cricket Ground Pitch Report. Pitch type: Batting. Description: TheSydney Cricket Groundis a Batting pitchAt Sydney Cricket Ground, the toss plays a crucial role, with teams batting first having a slight advantage, winning 52% of the time. The pitch tends to slow down in the second innings, making it harder to chase down big totals. Therefore, the team winning the toss is likely to opt for batting first to capitalize on the good conditions early on. This gives them a better chance of setting a challenging total and putting pressure on the chasing side. Source: https://pitch-report.com/sydney-cricket-ground-pitch-report/"}
{"vector_id": 73, "pk": 74, "table": "stadiums", "text": "Stadium: Maharaja Yadavindra Singh International Cricket Stadium Pitch Report. Pitch type: Batting. Description: Maharaja Yadavindra Singh International Cricket Stadiumis batting-friendly pitch.The surface provides good pace and bounce, allowing batsmen to play aggressive shots and score quickly. The boundaries are relatively short, which further enhances the potential for high-scoring matches. While pacers can extract some movement early on, the pitch generally favors batsmen, especially when the ball gets older, offering easy runs. Overall, it’s a pitch that promotes attacking cricket and results in high-scoring games. Source: http://pitch-report.com/maharaja-yadavindra-singh-international-cricket-stadium-pitch-report/"}
{"vector_id": 74, "pk": 75, "table": "stadiums", "text": "Stadium: Nassau County International Cricket Stadium Pitch Report. Pitch type: Bowling. Description: Nassau County International Stadium is a Bowling Pitch.TheNassau County International Stadiumis generally known to be abowling-friendly pitch. It provides significant assistance to bowlers, particularly in the early stages of the game. Fast bowlers can exploit the early swing, and spinners might find the surface offering some turn as the game progresses. The pitch typically leads to low-scoring encounters, as the bowlers are able to maintain control and dominate the batsmen. The challenging nature of the wicket often results in tight, low-scoring contests, with teams needing to be cautious in their batting approach. Source: https://pitch-report.com/nassau-county-international-cricket-stadium-pitch-report/"}
{"vector_id": 75, "pk": 76, "table": "stadiums", "text": "Stadium: Barsapara Cricket Stadium Pitch Report. Pitch type: Batting. Description: Barsapara Cricket Stadium is a Batting Pitch.Barsapara Cricket Stadium is known for being abatting-friendly pitch. The surface typically offers good bounce and pace, which allows batsmen to play their shots freely, especially in the early stages of the innings. However, as the game progresses, the pitch may slow down slightly, but it still remains favorable for batting, making it ideal for high-scoring matches. Bowlers will need to be strategic to pick wickets, especially in the later stages of the game. Source: https://pitch-report.com/barsapara-cricket-stadium-pitch-report/"}
{"vector_id": 76, "pk": 77, "table": "stadiums", "text": "Stadium: Dr Ys Rajasekhara Reddy Aca Vdca Cricket Stadium Pitch Report. Pitch type: Batting. Description: Dr. YS Rajasekhara Reddy ACA VDCA Stadium is known for its batting pitch.Dr. YS Rajasekhara Reddy ACA VDCA Stadium is known for its batting-friendly pitch, offering a smooth surface that allows batsmen to play their shots freely. The pitch provides consistent bounce and pace, making it a paradise for stroke-makers. Batters can build long innings here, especially as the game progresses and the pitch becomes even more predictable. Source: https://pitch-report.com/dr-ys-rajasekhara-reddy-aca-vdca-cricket-stadium-pitch-report/"}
{"vector_id": 77, "pk": 78, "table": "stadiums", "text": "Stadium: Headingley Cricket Ground Pitch Report. Pitch type: Bowling. Description: Headingley Cricket Ground is a Batting pitch.Headingley Cricket Ground is generally considered abowling-friendly pitch. Fast bowlers can extract early movement, especially if the conditions are overcast. The pitch can offer bounce and help seamers early on, while spinners may get assistance as the game progresses. So, if you’re predicting for the toss, the team winning it would likely prefer tobowlfirst. Source: https://pitch-report.com/headingley-cricket-ground-pitch-report/"}
{"vector_id": 78, "pk": 79, "table": "stadiums", "text": "Stadium: Himachal Pradesh Cricket Association Stadium Pitch Report. Pitch type: Batting. Description: The Himachal Pradesh Cricket Association Stadium is Batting Pitch.The Himachal Pradesh Cricket Association (HPCA) Stadium pitch tends to favor batting, especially in the first innings. With an average score of 184 for the team batting first, the pitch provides good conditions for batsmen to score runs freely, especially during the early part of the game. However, the pitch can provide some assistance to bowlers as the match progresses, particularly to spinners. In general, it is considered a batting-friendly pitch with some help for bowlers later on. Source: https://pitch-report.com/himachal-pradesh-cricket-association-stadium-pitch-report/"}
{"vector_id": 79, "pk": 95, "table": "stadiums", "text": "Stadium: Sky Stadium Wellington Pitch Report. Pitch type: Bowling. Description: Batting or Bowling PitchJoin Telegram Source: https://pitch-report.com/sky-stadium-wellington-pitch-report/"}
{"vector_id": 80, "pk": 80, "table": "stadiums", "text": "Stadium: Narendra Modi Stadium Pitch Report. Pitch type: Batting. Description: The Narendra Modi Stadium is renowned for its batting-friendly conditions, making it a paradise for batsmen.The pitch offers a true and consistent bounce, allowing players to execute their strokes freely. Fast outfields further enhance scoring opportunities, rewarding well-timed shots. While pacers may find some movement early on, the pitch generally settles into a batter’s haven as the game progresses. Spinners can come into play during the latter stages, adding an element of strategy to the game. High-scoring encounters are a hallmark of this venue, with batsmen often dominating proceedings, making it an exciting ground for cricket enthusiasts.Join Telegram Source: https://pitch-report.com/narendra-modi-stadium-pitch-report/"}
{"vector_id": 81, "pk": 81, "table": "stadiums", "text": "Stadium: Shaheed Veer Narayan Singh International Stadium Pitch Report. Pitch type: Batting. Description: The Shaheed Veer Narayan Singh International Stadium is a batting-friendly pitch.The Shaheed Veer Narayan Singh International Stadium in Raipur can occasionally offer assistance to bowlers, particularly in the early stages of the game. The pitch tends to provide good bounce and movement, making it challenging for batsmen, especially during the initial overs. Fast bowlers may find some swing and pace, while spinners can exploit any rough patches that develop as the game progresses. Though not predominantly a bowler’s pitch, it does offer a balanced contest, allowing bowlers to capitalize on favorable conditions when they arise. Source: https://pitch-report.com/shaheed-veer-narayan-singh-international-stadium-pitch-report/"}
{"vector_id": 82, "pk": 82, "table": "stadiums", "text": "Stadium: M Chinnaswamy Stadium Pitch Report. Pitch type: Batting. Description: M.Chinnaswamy Stadium is a batting friendly pitch.M. Chinnaswamy Stadium is known for being abatting-friendly pitch, offering good bounce and pace that favors the batsmen. The pitch tends to flatten out as the match progresses, allowing the batters to score freely, especially in the second innings. Although pacers can get some initial movement, the conditions generally favor high-scoring games. Teams chasing big totals here have a good chance of success if they can handle the pressure and pace of the initial overs. Source: https://pitch-report.com/m-chinnaswamy-stadium-pitch-report/"}
{"vector_id": 83, "pk": 83, "table": "stadiums", "text": "Stadium: Green Park Stadium Pitch Report. Pitch type: Bowling. Description: Bowling Freindly PitchGreen Park Stadium generally tends to favor bowlers, especially in the T20 format. With a dry and slightly slower surface, bowlers get good assistance, particularly spinners. However, during the latter stages of the match, the pitch becomes more favorable to the batting side, allowing for higher scores. Source: https://pitch-report.com/green-park-stadium-pitch-report/"}
{"vector_id": 84, "pk": 84, "table": "stadiums", "text": "Stadium: Dr Dy Patil Sports Academy Pitch Report. Pitch type: Batting. Description: The pitch at Dr. D.Y Patil Sports Academy is Batting  Pitch.This Stadium typically offers good bounce and consistent pace, allowing batsmen to play their shots comfortably. The surface is usually flat, creating ideal conditions for high scores, especially in limited-overs formats where aggressive batting takes center stage. Fast bowlers can find some movement early in the game, particularly under favorable weather conditions, but as the match progresses, it becomes easier for batsmen to settle in and build big partnerships. Spinners also come into play in the middle and later stages of the game, as the pitch tends to dry out slightly, offering some grip and turn. The high-altitude location can sometimes aid bowlers with extra carry, but overall, it remains a batsman-friendly venue. surface tends to be flat, providing ideal conditions for high scores, especially in limited-overs formats. Source: https://pitch-report.com/dr-dy-patil-sports-academy-pitch-report/"}
{"vector_id": 85, "pk": 85, "table": "stadiums", "text": "Stadium: Gaddafi Stadium Pitch Report. Pitch type: Batting. Description: Gaddafi Stadium is Batting friendly pitch.Gaddafi Stadium is widely regarded as a paradise for batsmen, thanks to its batting-friendly pitch. The surface offers consistent bounce and pace, allowing players to execute their shots with ease and confidence. Coupled with a fast outfield, even well-timed shots race to the boundary, making it a high-scoring venue. While spinners might get some grip as the match progresses, the pitch remains a haven for stroke-makers throughout most of the game. Source: https://pitch-report.com/gaddafi-stadium-pitch-report/"}
{"vector_id": 86, "pk": 86, "table": "stadiums", "text": "Stadium: Wankhede Stadium Pitch Report. Pitch type: Batting. Description: Wankhede Stadium is Batting Pitch.Wankhede Stadium in Mumbai is known for its batting-friendly pitch, offering a true bounce and fast outfield. The conditions favor stroke play, providing ample opportunity for the batsmen to score quickly. With its flat surface and shorter boundaries, it’s a high-scoring venue where big totals are often chased down with ease. Expect explosive batting performances under the bright lights of this iconic ground! Source: https://pitch-report.com/wankhede-stadium-pitch-report/"}
{"vector_id": 87, "pk": 87, "table": "stadiums", "text": "Stadium: Lords Cricket Ground Pitch Report. Pitch type: Bowling. Description: Lords  Cricket Ground Is a Bowling Pitch.Lord’s Cricket Ground is considered abowling-friendly pitch. The pitch typically offers assistance to both fast bowlers and spinners, particularly early in the game. Fast bowlers can extract movement, while spinners may find grip and turn as the match progresses. The conditions, especially with overcast weather, can make it challenging for batters in the initial overs. Teams winning the toss often choose to bowl first to take advantage of these favorable bowling conditions. As the game continues, the pitch may settle a bit, but bowling remains an advantage overall. Source: https://pitch-report.com/lords-cricket-ground-pitch-report/"}
{"vector_id": 88, "pk": 88, "table": "stadiums", "text": "Stadium: Queens Park Oval Pitch Report. Pitch type: Bowling. Description: Batting or Bowling Pitch Source: https://pitch-report.com/queens-park-oval-pitch-report/"}
{"vector_id": 89, "pk": 89, "table": "stadiums", "text": "Stadium: Barabati Stadium Pitch Report. Pitch type: Batting. Description: Barabati Stadium is a Batting Pitch.Barabati Stadium in Cuttack is known for its batting-friendly pitch, offering excellent conditions for scoring runs. The surface tends to favor batting, especially early on, making it ideal for setting big totals. While bowlers may find some challenge as the game progresses, chasing a score here is often more feasible due to the favorable conditions for batting throughout the match. The pitch supports high-scoring encounters, making it an exciting venue for both setting and chasing totals. Source: https://pitch-report.com/barabati-stadium-pitch-report/"}
{"vector_id": 90, "pk": 90, "table": "stadiums", "text": "Stadium: Edgbaston Cricket Ground Pitch Report. Pitch type: Mixed. Description: Edgbaston Cricket Ground Is a Source: https://pitch-report.com/edgbaston-cricket-ground-pitch-report/"}
{"vector_id": 91, "pk": 91, "table": "stadiums", "text": "Stadium: Jsca International Stadium Complex Pitch Report. Pitch type: Bowling. Description: The JSCA International Stadium isbowling pitch.The JSCA International Stadium is generally considered abowling pitch. The conditions tend to favor bowlers, especially in the second innings, with the pitch offering some assistance in terms of bounce and movement. While batsmen may find some opportunities early on, the surface can become tougher to bat on as the game progresses, making it more favorable for the bowlers. Source: http://pitch-report.com/jsca-international-stadium-complex-pitch-report/"}
{"vector_id": 92, "pk": 92, "table": "stadiums", "text": "Stadium: Multan Cricket Stadium Pitch Report. Pitch type: Batting. Description: Multan Stadium is a batting pitch.Multan Cricket Stadiumis renowned for itsbatting-friendly conditions, offering a great surface for batsmen to score freely. The pitch provides solid support for aggressive batting early on, making it ideal for setting big totals. Although the conditions may become more challenging as the game progresses, the early stages remain favorable for batsmen. Teams winning the toss would likely choose tobat first, aiming to capitalize on the favorable conditions and put up a strong total. Source: https://pitch-report.com/multan-cricket-stadium-pitch-report/"}
{"vector_id": 93, "pk": 96, "table": "stadiums", "text": "Stadium: Vidarbha Cricket Association Stadium Pitch Report. Pitch type: Batting. Description: Vidarbha Cricket Association Stadium is a Batting Pitch.The pitch at Vidarbha Cricket Association Stadium is consideredbatting-friendly, offering solid bounce and pace. Batsmen are expected to dominate the conditions, with the ball coming onto the bat nicely, allowing for stroke play. The surface supports aggressive batting, particularly in the early stages, and is ideal for top-order batsmen to settle in and build partnerships. This pitch offers good scoring potential, making it favorable for high totals in the first innings. Source: https://pitch-report.com/vidarbha-cricket-association-stadium-pitch-report/"}
{"vector_id": 94, "pk": 97, "table": "stadiums", "text": "Stadium: Gwalior International Cricket Stadium Pitch Report. Pitch type: Batting. Description: Gwalior International Stadium is considered a batting pitch.The surface provides a solid foundation for batters, allowing them to play aggressive shots once they get set. The pitch generally offers good bounce and a consistent pace, making it easier for batsmen to time the ball well. While there may be some assistance for bowlers early on, especially in the first few overs, the conditions generally favor high scores and a free-flowing contest between bat and ball. Source: https://pitch-report.com/gwalior-international-cricket-stadium-pitch-report/"}
{"vector_id": 95, "pk": 98, "table": "stadiums", "text": "Stadium: Eden Gardens Pitch Report. Pitch type: Batting. Description: Eden Gardenis a Batting PitchEden Gardensin Kolkata is renowned as abatting-friendly pitch, especially in limited-overs cricket. The surface typically offers consistent bounce and pace, allowing batsmen to play their shots freely. In day-night matches, the pitch often favors batters in the first innings, with spinners coming into play as the game progresses. Fast outfield and shorter boundaries further enhance scoring opportunities, making it a high-scoring venue. Bowlers, particularly spinners, can find assistance in the second innings due to the pitch slowing down slightly. Overall, Eden Gardens is a paradise for batsmen and an exciting venue for fans. Source: https://pitch-report.com/eden-gardens-pitch-report/"}
{"vector_id": 96, "pk": 99, "table": "stadiums", "text": "Stadium: Basin Reserve Wellington Pitch Report. Pitch type: Batting. Description: Basin Reserve is a Batting pitch.In this ground it is generally consider a batting pitch, but it tends to favor the batters, especially in limited-overs formats. The pitch provides good bounce and pace, which helps the batsmen play aggressive shots. However, it can also offer some assistance to bowlers, particularly pacers, early in the innings or under overcast conditions. Overall, while both batters and bowlers can find some advantage, Basin Reserve is known to offer favorable conditions for batting, making for high-scoring matches in limited-overs cricket. Source: https://pitch-report.com/basin-reserve-wellington-pitch-report/"}
{"vector_id": 97, "pk": 100, "table": "stadiums", "text": "Stadium: Sheikh Zayed Stadium Pitch Report. Pitch type: Batting. Description: The Sheikh Zayed Stadium is batting pitch.The Sheikh Zayed Stadium is a batting-friendly pitch. It offers good bounce and carry, allowing batters to play their shots freely, especially in the early overs. However, spinners may find some assistance as the match progresses, keeping the contest balanced.Join Telegram Source: https://pitch-report.com/sheikh-zayed-stadium-pitch-report/"}
{"vector_id": 98, "pk": 101, "table": "stadiums", "text": "Stadium: Rawalpindi Cricket Stadium Pitch Report. Pitch type: Batting. Description: Rawal Pindi Ground is a Batting Behaviour Pitch.The Rawalpindi Ground is known for itsbatting-friendly pitch, offering excellent conditions for batsmen. The surface provides good pace and bounce, making it easier for batsmen to score freely and play aggressive shots. As a result, high-scoring matches are common here, with batsmen benefiting from the favorable pitch conditions. The pitch generally favors attacking play and allows for big totals to be set. Source: https://pitch-report.com/rawalpindi-cricket-stadium-pitch-report/"}
{"vector_id": 99, "pk": 102, "table": "stadiums", "text": "Stadium: Rajiv Gandhi International Stadium Pitch Report. Pitch type: Batting. Description: Rajiv Gandhi International Cricket Stadium in Hyderabad is known for its batting-friendly pitch.The surface is generally flat, providing excellent bounce and pace, which favors the batsmen, particularly in limited-overs formats like ODIs and T20s. The relatively small boundaries further contribute to high-scoring games, making it an exciting venue for batters. While bowlers may find some assistance early in the innings or under lights, the overall conditions typically tilt in favor of the batters, leading to thrilling, high-scoring encounters. Source: https://pitch-report.com/rajiv-gandhi-international-stadium-pitch-report/"}
{"vector_id": 100, "pk": 103, "table": "stadiums", "text": "Stadium: The Rose Bowl Pitch Report. Pitch type: Batting. Description: The Rose Bowl Cricket Ground Is a Batting Pitch.The Rose Bowl Cricket Ground is known for its batting-friendly pitch, which tends to favor batsmen with consistent bounce and good carry. This surface often leads to high-scoring games, allowing batters to play aggressive shots throughout the innings. While bowlers can still make an impact, the pitch generally offers more rewards to those who are patient and able to build partnerships. The conditions at this venue create an exciting atmosphere, with big totals and thrilling run chases being a common feature. Source: https://pitch-report.com/the-rose-bowl-pitch-report/"}
{"vector_id": 101, "pk": 104, "table": "stadiums", "text": "Stadium: Supersport Park Pitch Report. Pitch type: Batting. Description: SuperSport Park Stadium is a batting freindly pitchThe surface at SuperSport Park in Centurion is known for its flat,batting-friendly conditions, offering little assistance to bowlers. While batters can accumulate runs quickly, captains winning the toss may prefer tobowl first, aiming to exploit any early movement or potential moisture in the pitch before it becomes easier to bat in the second innings. This strategy provides a chance tochase downa target later on a more predictable surface. Source: https://pitch-report.com/supersport-park-pitch-report/"}
{"vector_id": 102, "pk": 105, "table": "stadiums", "text": "Stadium: Rajiv Gandhi International Cricket Stadium Pitch Report. Pitch type: Batting. Description: Rajiv Gandhi International Stadium is a Batting Pitch.The pitch at Rajiv Gandhi International Stadium is known to be batting-friendly, offering excellent conditions for batsmen to thrive. The surface is typically flat and true, providing consistent bounce that allows the ball to come onto the bat nicely. This makes it an ideal ground for aggressive batting, where players can play their shots freely, especially in the early stages of the game. With minimal assistance for bowlers, batters often have the opportunity to score quickly, leading to high-scoring encounters. The pitch offers a great opportunity for top-order batsmen to make big contributions, and it’s not uncommon to see large totals posted here, making it a favorite for exciting, run-filled matches. Source: https://pitch-report.com/rajiv-gandhi-international-cricket-stadium-pitch-report/"}
{"vector_id": 103, "pk": 106, "table": "stadiums", "text": "Stadium: R Premadasa Stadium Khettarama Pitch Report. Pitch type: Mixed. Description: R.Premadasa Stadium is a bowlling pitchR.Premadasa Stadium is known for being a bowler-friendly pitch where pacers can exploit early movement, and spinners often play a key role as the game progresses. The surface tends to provide assistance to bowlers, especially in the first innings, making it challenging for batsmen to settle. Teams winning the toss may prefer to bowl first, taking advantage of the conditions that favor bowlers early on.Join Telegram Source: https://pitch-report.com/r-premadasa-stadium-khettarama-pitch-report/"}
{"vector_id": 104, "pk": 107, "table": "stadiums", "text": "Stadium: Holkar Cricket Stadium Pitch Report. Pitch type: Batting. Description: Holkar Stadium is  batting pitch.. The surface tends to favor batsmen, providing good bounce and pace, making it ideal for stroke play. While fast bowlers may find some assistance with the new ball, the pitch typically becomes more favorable for batsmen as the game progresses. Spinners can also come into play during the middle overs, but overall, it is a high-scoring ground, with batters having the advantage. Source: https://pitch-report.com/holkar-cricket-stadium-pitch-report/"}
{"vector_id": 105, "pk": 108, "table": "stadiums", "text": "Stadium: Today Ipl Match Pitch Report. Source: https://pitch-report.com/today-ipl-match-pitch-report/"}
{"vector_id": 106, "pk": 109, "table": "stadiums", "text": "Stadium: Simonds Stadium Pitch Report. Pitch type: Batting. Description: Simonds Stadium is batting pitch.Simonds Stadium (GMHBA Stadium) in Geelong is generally known to favorbatting. The pitch offers good bounce and pace, which benefits the batters, especially early in the innings. However, as the game progresses,bowlers—particularly spinners—can get more assistance from the slowing conditions, making it more challenging for the batting side in the later stages. Overall, the pitch tends to be morebatting-friendly. Source: https://pitch-report.com/simonds-stadium-pitch-report/"}
{"vector_id": 107, "pk": 110, "table": "stadiums", "text": "Stadium: Mahinda Rajapaksa International Cricket Stadium Pitch Report. Pitch type: Bowling. Description: Batting or Bowling PitchJoin Telegram Source: https://pitch-report.com/mahinda-rajapaksa-international-cricket-stadium-pitch-report/"}
{"vector_id": 108, "pk": 111, "table": "stadiums", "text": "Stadium: University Of Texas Dallas Pitch Report. Pitch type: Bowling. Description: Batting or Bowling Pitch Source: https://pitch-report.com/university-of-texas-dallas-pitch-report/"}
{"vector_id": 109, "pk": 112, "table": "stadiums", "text": "Stadium: Eden Park Auckland Pitch Report. Pitch type: Bowling. Description: Eden park cricket stadium is a bowling pitch.Eden Park is known for itsbowling-friendly pitch, where the conditions early in the match offer significant assistance to bowlers, especially pacers. The pitch can be challenging for batsmen, particularly in the second innings, as it tends to become more difficult to score. Teams bowling first can capitalize on these conditions to restrict the opposition to a low total. In contrast, the batting side may struggle to chase down the target in the second innings due to the harsh pitch conditions. Source: https://pitch-report.com/eden-park-auckland-pitch-report/"}
{"vector_id": 110, "pk": 113, "table": "stadiums", "text": "Stadium: Hagley Oval Christ Church Pitch Report. Pitch type: Batting. Description: Hagley Oval Ground is a batting Pitch.The pitch offers good bounce and pace, making it favorable for batsmen, especially during the early stages of the match. It allows players to build solid innings, and the outfield is typically quick, which encourages boundary-hitting. While the bowlers do get some assistance early on, the surface tends to flatten out as the game progresses, offering ideal conditions for the batting side to dominate. This combination of factors makes it a great venue for high-scoring encounters. Source: https://pitch-report.com/hagley-oval-christ-church-pitch-report/"}
{"vector_id": 111, "pk": 114, "table": "stadiums", "text": "Stadium: Maharashtra Cricket Association Stadium Pitch Report. Pitch type: Batting. Description: Maharashtra Cricket Association Stadiumis known for itsbatting-friendly pitchThe pitch generally provides good conditions for batsmen, especially in the first innings, allowing them to score freely. As the game progresses, it remains relatively flat, making it easier for the batting side to post big totals. While spinners may come into play later in the match, the ground is primarily seen as a venue where high scores are achievable, making it a thrilling place for run-fests. Source: https://pitch-report.com/maharashtra-cricket-association-stadium-pitch-report/"}
{"vector_id": 112, "pk": 115, "table": "stadiums", "text": "Stadium: Bay Oval Mount Maunganui Pitch Report. Pitch type: Bowling. Description: Bay Oval Cricket Ground is Bowling Pitch.Bay Oval’s bowling pitch is a dynamic challenge for bowlers, with its fresh grass providing ideal conditions for pace and bounce. Fast bowlers can capitalize on the early moisture for swing, while seamers can find movement off the pitch. The conditions remain favorable for bowlers throughout, offering a perfect balance of speed and swing, ensuring an exciting battle between bat and ball. Source: https://pitch-report.com/bay-oval-mount-maunganui-pitch-report/"}
{"vector_id": 113, "pk": 116, "table": "stadiums", "text": "Stadium: Perth Stadium Pitch Report. Pitch type: Bowling. Description: Perth Stadium is a bowling pitch that supports pacers.Perth Stadium is renowned for its pace and bounce, creating the perfect conditions for fast bowlers. With such a dynamic surface, this match is set to deliver an exciting start to the series. So its clearly visible that Perth Stadium is a bowling pitch. Source: https://pitch-report.com/perth-stadium-pitch-report/"}
{"vector_id": 114, "pk": 117, "table": "stadiums", "text": "Stadium: Trent Bridge Pitch Report. Pitch type: Batting. Description: Trent Bridge Stadium Is a Batting Pitch.Trent Bridge Stadium is generally considered abatting-friendly pitch. The surface offers good bounce and pace, which allows batsmen to play their shots confidently. While it does provide some assistance to the bowlers, especially early on, the conditions tend to favor the batters, making it an ideal venue for high-scoring matches. The boundary sizes and flat nature of the pitch further enhance the prospects for big totals. Source: https://pitch-report.com/trent-bridge-pitch-report/"}
{"vector_id": 115, "pk": 118, "table": "stadiums", "text": "Stadium: Newlands Pitch Report. Pitch type: Batting. Description: Newlands Cricket Stadium is a Batting Pitch.Newlands Cricket Stadium is known for providing a balanced pitch that starts off challenging for batsmen but gradually becomes more favorable as the match progresses. Initially, fast bowlers can extract movement, making it tough for the batsmen. However, after the first few overs, the pitch settles, offering consistent bounce and allowing the batters to dominate the game. Overall, it’s a pitch that strengthens batting in the later stages. Source: https://pitch-report.com/newlands-pitch-report/"}
{"vector_id": 116, "pk": 119, "table": "stadiums", "text": "Stadium: Old Trafford Pitch Report. Pitch type: Batting. Description: Old Trafford Cricket Ground Is a batting Pitch.Old Trafford Cricket Ground is generally considered abatting-friendly pitch. The surface typically offers good bounce and pace, making it conducive to high scoring. Batsmen can play their shots with confidence, especially during the first innings. While bowlers might find some assistance in the early overs, the pitch usually becomes more favorable for batting as the game progresses, allowing for big totals. Teams winning the toss often choose to bat first, taking advantage of the favorable batting conditions early in the match. Source: https://pitch-report.com/old-trafford-pitch-report/"}
{"vector_id": 117, "pk": 120, "table": "stadiums", "text": "Stadium: Docklands Stadium Pitch Report. Pitch type: Bowling. Description: Docklands Stadium is a bowling-friendly pitch, favoring pacersDocklands Stadium, also known as Marvel Stadium, is generally considered a bowling-friendly pitch, especially for pacers. The surface often offers good bounce and carry, making it ideal for seam and swing bowlers. Spinners may find it challenging, but disciplined bowling can create opportunities. Scores here are usually moderate, making it a competitive venue Source: https://pitch-report.com/docklands-stadium-pitch-report/"}
{"vector_id": 118, "pk": 121, "table": "stadiums", "text": "Stadium: Sulaibiya Cricket Ground Pitch Report. Pitch type: Bowling. Description: Batting or Bowling Pitch Source: https://pitch-report.com/sulaibiya-cricket-ground-pitch-report/"}
{"vector_id": 119, "pk": 122, "table": "stadiums", "text": "Stadium: National Stadium Karachi Pitch Report. Pitch type: Batting. Description: National Cricket Stadium Is a Batting Pitch.National Cricket Stadium is a batting-friendly pitch that tends to favor the batsmen. The surface generally offers good bounce and pace, allowing the batters to play their shots with confidence. Expect higher scores and quick run rates, especially in the first innings. The bowlers will need to be accurate and strategic to make an impact on this pitch. Source: https://pitch-report.com/national-stadium-karachi-pitch-report/"}
{"vector_id": 120, "pk": 123, "table": "stadiums", "text": "Stadium: Melbourne Stadium Pitch Report. Pitch type: Batting. Description: MCG offers a balanced pitch with great scoring opportunities for batters.Melbourne Cricket Ground (MCG) is known for its balanced pitch, but when it comes to batting, it offers a lot to the players. The surface tends to be flat, especially in the early overs, making it ideal for stroke play. With its massive outfield, batters can take advantage of gaps and convert ones into twos. However, as the match progresses, the pitch may slow down, making shot selection crucial. A dream venue for batters who enjoy building their innings!Join Telegram Source: https://pitch-report.com/melbourne-stadium-pitch-report/"}
{"vector_id": 121, "pk": 124, "table": "stadiums", "text": "Stadium: Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium Pitch Report. Pitch type: Batting. Description: Balanced with a slight edge for batting.Ekana Cricket Stadium in Cuttack generally favors the batsmen, with a good balance between bat and ball. The pitch tends to provide a decent amount of bounce and carry, helping the batsmen to score runs, especially in the initial overs. However, the spinners can also come into play later in the game, making it a mixed surface. Source: https://pitch-report.com/bharat-ratna-shri-atal-bihari-vajpayee-ekana-cricket-stadium-pitch-report/"}
{"vector_id": 122, "pk": 125, "table": "stadiums", "text": "Stadium: Arun Jaitley Stadium Pitch Report. Pitch type: Batting. Description: Arun Jaitley Stadium favors batsmen with good bounce and short boundaries.Arun Jaitley Stadium is known for being a batting-friendly pitch. The surface offers good bounce and a solid foundation, which allows batsmen to play their shots with confidence. With shorter boundaries, it provides ample opportunities for quick runs. While pacers might find some assistance early on, the pitch generally favors the batsmen, especially in the first innings. This makes it a great venue for high-scoring matches, with the potential for big totals. However, as the game progresses, spinners may also find some grip in the later overs. Source: https://pitch-report.com/arun-jaitley-stadium-pitch-report/"}
{"vector_id": 123, "pk": 126, "table": "stadiums", "text": "Stadium: Ma Chidambaram Stadium Pitch Report. Pitch type: Batting. Description: MA Chidambaram Stadium is a Batting Pitch.The pitch is known for its strong support for batsmen, especially early in the game, allowing them to score freely with good pace and bounce. While the surface may slow down as the match progresses, batters who can adapt to changing conditions often dominate. Spinners come into play later, but the initial stages provide an excellent opportunity for batsmen to capitalize. A team with powerful top-order batters who can exploit the favorable conditions early tends to thrive at this venue. Source: https://pitch-report.com/ma-chidambaram-stadium-pitch-report/"}
{"vector_id": 124, "pk": 127, "table": "stadiums", "text": "Stadium: Greenfield International Stadium Report. Pitch type: Bowling. Description: The Greenfield International Stadium is  bowling-friendly pitch.Greenfield International Stadium is known for its bowling-friendly pitch, where bowlers typically find more assistance than batsmen. Fast bowlers can extract movement early in the game, especially with overcast conditions, while spinners come into play as the match progresses, benefiting from the pitch’s grip and turn. The surface tends to offer consistent bounce, which challenges the batsmen to play with caution. Due to these conditions, matches often see low to moderate scores, and bowling units tend to dominate, making it a challenging venue for aggressive batting. Source: https://pitch-report.com/greenfield-international-stadium-report/"}
